Repository: FreshKernel/alrayada
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Categories
ar: التصنيفات

# shoppingCart
source: Cart
ar: السلة

source: Home
ar: الصفحة الرئيسية

source: Account
ar: الحساب

# noData
source: There is no data.
ar: لايوجد هناك بيانات.

source: Add to cart
ar: إضافة الى السلة

# addToWishlist
source: Wishlist
ar: إضافة الى الرغبات

source: Description
ar: الوصف

source: Short description
ar: الوصف المختصر

source: Edit
ar: تعديل

source: Update
ar: تحديث

source: Cancel
ar: الغاء

source: Delete
ar: حذف

source: Checkout
ar: إدفع

source: Confirm
ar: تأكيد

source: You need to log in first.
ar: تحتاج لتسجيل الدخول اولا

source: Not authenticated
ar: غير مصدق

source: Ok
ar: موافق

source: Not activated!
ar: غير مفعل!

source: Your account need to be activated
ar: حسابك غير مفعل

source: Order notes
ar: ملاحظات الطلب

# youAreAboutToCreateOrder
source: You are about to create an order!
ar: انت على وشك إرسال طلبك!

# orderTotal
source: Total
ar: المجموع النهائي

source: Sign in
ar: تسجيل الدخول

source: Sign up
ar: إنشاء الحساب

source: Logout
ar: تسجيل الخروج

source: Authentication
ar: المصادقة

source: Welcome again!
ar: مرحبا مجددا

source: Register account
ar: تسجيل حساب جديد

source: Enter the account credentials to continue
ar: ادخل معلومات الحساب للمتابعة

source: Email address
ar: عنوان البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Confirm password
ar: تأكيد كلمة المرور

# labPhoneNumber
source: Lab phone
ar: رقم المختبر

# labOwnerPhoneNumber
source: Owner phone
ar: رقم المالك

source: Lab name
ar: اسم المختبر

source: Lab owner name
ar: اسم مالك المختبر

source: City
ar: المدينة

# selectedCity
source: Selected city {city}
ar: المدينة المختارة {city}

source: Forgot Password
ar: نسيت كلمة المرور

# forgotPasswordWithQuestionMark
source: Forgot password?
ar: نسيت كلمة المرور؟

source: Reset password
ar: إعادة تعيين كلمة المرور

# forgotPasswordDesc
source: No worries â€“ it happens! Enter your email to reset your password and regain access in a snap. We're here to help you swiftly regain control of your account!
ar: لا داعي للقلق – يحدث للجميع! أدخل بريدك الإلكتروني لإعادة تعيين كلمة المرور والعودة إلى حسابك بسرعة. نحن هنا لمساعدتك في استعادة السيطرة على حسابك بسرعة!

source: Don't have account yet?
ar: ليس لديك حساب؟

source: Already have account?
ar: لديك حساب بالفعل؟

source: Search
ar: بحث

source: Submit
ar: إرسال

source: Field should not be empty.
ar: هذه الحقل مطلوب

source: Email address is empty.
ar: عنوان البريد الألكتروني فارغ.

source: Please enter valid email address.
ar: الرجاء إدخال عنوان بريد الكتروني صالح.

source: Password should not be empty.
ar: كلمة المرور مطلوبة

# passwordShouldBeAtLeast8Chars
source: Password should be at least 8 characters.
ar: كلمة المرور يجب أن تحتوي على ٨ حروف على الأقل

# passwordShouldBeLessThan255Chars
source: Password should be less than 255 characters
ar: يجب أن تكون كلمة المرور أقل من ١٢٨ حرفا

source: Password must contain at least one uppercase character.
ar: يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل.

source: Password must contain at least one lowercase character.
ar: يجب أن تحتوي كلمة المرور على حرف صغير واحد على الأقل.

source: Password must contain at least one digit.
ar: يجب أن تحتوي كلمة المرور على رقم واحد على الأقل.

# passwordMustContainAtLeastOneSpecialCharacter
source: Password must contain at least one special character (e.g., ! @ # $ %)
ar: يجب أن تحتوي كلمة المرور على حرف مميز واحد على الأقل (مثل ! @ # $ %).

source: Password should be strong.
ar: يجب أن تكون كلمة المرور قوية

source: Confirm password does not match
ar: كلمة المرور غير متطابق

# phoneNumberShouldNotBeEmpty
source: Phone number is required
ar: رقم الهاتف مطلوب

# phoneNumberMustBeValid
source: Phone number must 11 digits (07*********)
ar: يجب أن يكون رقم الهاتف مكون من ١١ رقم (*********07)

source: Update password
ar: تحديث كلمة المرور

source: Current password
ar: كلمة المرور الحالية

source: New password
ar: كلمة المرور الجديدة

source: Account data
ar: معلومات الحساب

source: Update all of your data
ar: تحديث جميع بياناتك

source: Orders
ar: الطلبات

# viewAllOfYourOrders
source: View all of your orders, you can cancel any order that hasn't approved or rejected yet
ar: شاهد جميع طلباتك مع إمكانية الغائها ان لم يتم الموافقة عليها

source: Favorites
ar: قائمة الرغبات

source: View all of your wishlist
ar: إظهار قائمة الرغبات

source: Privacy Policy
ar: سياسة الخصوصية

# openPrivacyPolicyPage
source: Open our privacy policy page
ar: افتح صفحة سياسة الخصوصية

source: Social media
ar: مواقع التواصل الأجتماعي

# followUsOnSocialMedia
source: Follow us on social media accounts
ar: تابعونا على مواقع التواصل الأجتماعي

source: Settings
ar: الإعدادات

source: Select your preferences
ar: حدد تفضيلاتك واختياراتك

# welcomeAgainWithLabName
source: Welcome again, {labName}
ar: مرحبا مجددا، دكتور {labName}

# joinedInWithDate
source: Join in {date}
ar: تم الأنضمام في {date}

source: Success!
ar: تمت العملية بنجاح!

source: Error!
ar: خطا!

source: Data has been successfully updated!
ar: تم تحديث البيانات بنجاح!

source: Order has been created.
ar: تم إنشاء طلبك

source: Open products list page
ar: فتح صفحة المنتجات

source: Support
ar: الدعم

source: Guest user
ar: حساب زائر

source: Animations
ar: العناصر المتحركة

# animationsDesc
source: Enable it if you want fancy animations in the app
ar: قم بتمكينه إذا كنت تريد عناصر متحركة في التطبيق

source: Confirm delete cart item
ar: تأكيد حذف عنصر سلة التسوق

# confirmDeleteCartItemSettingsDesc
source: When you delete a product from the cart, should we confirm the delete process by displaying a dialog?
ar: عندما تحذف عنصر من سلة التسوق، هل يجب علينا أن نؤكد عملية الحذف من خلال عرض رسالة تأكيد؟

source: Clear cart after checkout
ar: إفراغ السلة بعد الدفع

# clearCartAfterCheckoutSettingsDesc
source: After perform checkout and the order successfully created, should the shopping cart cleared?
ar: بعد إجراء عملية الدفع وإنشاء الطلب بنجاح ، هل يجب إفراغ عربة التسوق؟

source: Force use scrollable chart
ar: فرض أستخدام جدول قابل للتمرير

# forceUseScrollableChartSettingsDesc
source: The chart by default is scrollable for smaller screens, check this if you want to make it scrollable no matter what
ar: بشكل افتراضي، يكون الجدول قابل للتمرير على الشاشات الصغيرة، اذا كنت تريد الجدول قابل للتمريد بغض النظر عن نوع الشاشة، قم بتمكين هذه الإعداد

source: Prefer numbers in chart months
ar: استخدام رقم الشهر في جدول الأشهر

# preferNumbersInChartMonthsSettingsDesc
source: Use the number of the month instead of first 3 characters of the month
ar: أستخدام رقم الشهر بدلا من اول ثلاث أحرف من الشهر باللغة الأنكليزية

# unFocusAfterSendMessage
source: UnFocus after send a chat message
ar: قم بإلغاء التركيز بعد إرسال رسالة دردشة

# unFocusAfterSendMessageSettingsDesc
source: After send message using the send button, should we hide the keyboard?
ar: بعد إرسال الرسالة باستخدام زر الإرسال ، هل يجب إخفاء لوحة المفاتيح؟

source: Use classic message bubble
ar: استخدم فقاعة الرسائل الكلاسيكية

# useClassicMessageBubbleSettingsDesc
source: In the support, should the app use the classic message bubble for each message item?
ar: في الدعم ، هل يجب أن يتم أستخدام فقاعة الرسائل الكلاسيكية لكل رسالة؟

source: Statistics
ar: إحصائيات

source: Reset favorites
ar: إعادة تعيين قائمة الرغبات

# developedByWithDeveloperName
source: Developed by {developerName}
ar: تم تطويره من قبل {developerName}

source: Account created
ar: تم إنشاء الحساب

# accountCreatedBut
source: Account has been successfully created, we will need to review your information's and after that you can shop from the app app, to login, you will have to verify your email address by the link that we have sent to you
ar: تم إنشاء الحساب بنجاح، ولكن قبل أن تتمكن من التسوق من خلال التطبيق، سنحتاج الى مراجعة حسابك، لتسجيل الدخول الرجاء تأكيد الحساب عبر الرابط الذي تم إرساله لك

source: Unknown error
ar: خطأ غير معروف

# unknownErrorWithMsg
source: Unknown error: {error}
ar: خطأ غير معروف: {error}

# authTooManyFailedAttempts
source: Too many failed attempts, Please try again later.
ar: عدد محاولات التسجيل كثيرة جدا، الرجاء المحاولة مرة اخرى في وقت لاحق

# authIncorrectPassword
source: Incorrect password.
ar: كلمة مرور غير صحيحة

# authIncorrectEmailOrPassword
source: Invalid email or password.
ar: بريد إلكتروني أو كلمة مرور غير صالحة.

# authEmailNotFound
source: Email not found. Please check your email address and try again.
ar: البريد الإلكتروني غير موجود. يرجى التحقق من عنوان بريدك الإلكتروني والمحاولة مرة أخرى.

# authEmailAlreadyInUse
source: Email already in use. Please use a different email or try logging in.
ar: البريد الإلكتروني مستخدم بالفعل. يرجى استخدام بريد إلكتروني آخر أو محاولة تسجيل الدخول.

source: Create new account
ar: إنشاء حساب جديد

# authAreYouSureWantToContinueCreateAccount
source: Are you sure want to continue? you will need to confirm your email address to login, and waiting until your account approved before you can shop from the app
ar: هل أنت متأكد أنك تريد الاستمرار؟ ستحتاج إلى تأكيد عنوان بريدك الإلكتروني لتسجيل الدخول ، والانتظار حتى تتم الموافقة على حسابك قبل أن تتمكن من التسوق من التطبيق

# authEmailVerificationHasNotSentError
source: An error occurred while sending the email verification link, please try again by sign in or try to contact us
ar: حدث خطأ أثناء إرسال رابط التحقق عبر البريد الإلكتروني، يرجى المحاولة مرة أخرى من خلال تسجيل الدخول او أتصل بنا

# verificationLinkIsAlreadySentWithMinutesToExpire
source: Verification link is already sent, it will expire after {number} minutes.
ar: تم إرسال رابط التحقق بالفعل ، وسوف تنتهي صلاحيته بعد {number} دقيقة.

source: Or sign in using social media account
ar: او سجل باستخدام مواقع التواصل الأجتماعي

source: Delete account
ar: حذف الحساب

source: Confirm delete account
ar: تأكيد حذف الحساب

# authAccountDeleteConfirmation
source: To confirm delete your account, please enter "Delete" in the text input without the double quotes to confirm the delete process
ar: لتأكيد حذف حسابك ، يرجى إدخال "حذف" في إدخال النص بدون علامات الاقتباس المزدوجة لتأكيد عملية الحذف

source: Refresh
ar: تحديث

source: Try again
ar: المحاولة مجددا

source: Common
ar: شائع

source: General
ar: عام

source: Theme mode
ar: سمة التطبيق

# themeModeSettingsDesc
source: Choose if you want dark or light theme, or use the default system mode
ar: اختر ما إذا كنت تريد مظهرًا داكنًا أو فاتحًا ، أو وضع النظام الافتراضي

source: Dark
ar: داكن

source: Light
ar: فاتح

source: System
ar: النظام

source: Random
ar: عشوائي

# themeModeDarkDesc
source: Enable dark mode for a consistently darker appearance.
ar: تمكين وضع الظلام لمظهر داكن بشكل متسق.

# themeModeLightDesc
source: Enable light mode for a consistently brighter appearance.
ar: تمكين وضع النور لمظهر فاتح بشكل متسق.

# themeModeSystemDesc
source: Sync with system settings for a seamless experience.
ar: مزامنة مع إعدادات النظام لتجربة سلسة.

# themeModeAutoDesc
source: Automatically adjust based on your local time for optimal visibility.
ar: ضبط تلقائي بناءً على الوقت المحلي لرؤية مثلى.

# themeModeRandomDesc
source: Experience a random theme each time the app starts for a fresh look.
ar: تجربة نمط عشوائي في كل مرة يبدأ فيها التطبيق لمظهر جديد.

# darkModeDuringDay
source: Daytime Dark Mode
ar: وضع الظلام نهارًا

# darkModeDuringDayDesc
source: Automatically switch to dark mode during the day or the opposite, as per your preference.
ar: التبديل التلقائي إلى وضع الظلام نهارًا أو العكس، حسب تفضيلاتك.

source: Auto
ar: تلقائي

source: Clear preferences
ar: امسح كل التفضيلات

source: Under development
ar: تحت التطوير

source: Offers of the month
ar: عروض الشهر

# offersPictures
source: Pictures of the month's offers
ar: صور عروض الشهر

source: Next
ar: التالي

source: Skip
ar: تخطي

source: Get started
ar: ابدأ

# onlineShoppingMadeEasyFeature
source: Online shopping made easy
ar: أصبح التسوق الألكتروني سهلاً

# onlineShoppingMadeEasyFeatureDesc
source: Shop from the comfort of your own home with just a few taps
ar: تسوق وأنت مرتاح في منزلك ببضع نقرات فقط

# secureShoppingExperienceFeature
source: Secure shopping experience
ar: تجربة تسوق آمنة

# secureShoppingExperienceFeatureDesc
source: Shop with confidence knowing that your personal information is safe and secure
ar: تسوق بثقة مع العلم أن معلوماتك الشخصية آمنة ومأمونة

# favoritesWishlistFeature
source: Favorites wishlist
ar: قائمة الرغبات المفضلة

# favoritesWishlistFeatureDesc
source: Save your favorite items for later use and quickly access it each time
ar: احفظ عناصرك المفضلة لاستخدامها لاحقًا وقم بالوصول إليها بسرعة في كل مرة

# easyFilteringAndSearchingFeature
source: Easy filtering and searching
ar: عملية تصفية وبحث سهلة وسريعة

# easyFilteringAndSearchingFeatureDesc
source: Find exactly what you're looking for with our easy-to-use filtering and searching functionality
ar: اعثر على ما تبحث عنه بالضبط من خلال وظيفة التصفية والبحث سهلة الاستخدام

# socialAuthenticationFeature
source: Social authentication
ar: سجل دخولك بواسطة منصات التواصل الأجتماعي

# socialAuthenticationFeatureDesc
source: Sign up or log in with your favorite social media platform for a seamless shopping experience
ar: قم بالتسجيل أو تسجيل الدخول باستخدام منصة الوسائط الاجتماعية المفضلة لديك للحصول على تجربة تسوق سلسة

# fastShippingFeature
source: Fast shipping
ar: شحن سريع

# fastShippingFeatureDesc
source: Get your items delivered to your lab quickly and reliably
ar: احصل على العناصر الخاصة بك إلى مختبرك بسرعة وموثوقية

# inAppSupportChatFeature
source: In-app support chat
ar: دعم الدردشة داخل التطبيق

# inAppSupportChatFeatureDesc
source: Get help and support from our friendly customer service team without ever leaving the app
ar: احصل على المساعدة والدعم من فريق خدمة العملاء الودود لدينا دون مغادرة التطبيق

# underDevelopmentFeature
source: Under development
ar: تحت التطوير

# underDevelopmentFeatureDesc
source: Thank you for using our app! Please note that we are still working hard to improve your experience
ar: شكرا لك على استخدام التطبيق لدينا! يرجى ملاحظة أننا ما زلنا نعمل بجد لتحسين تجربتك

source: No
ar: كلا

source: Yes
ar: نعم

source: Close the app
ar: الخروج من التطبيق

# closeTheAppMsg
source: Are you sure you want to exit the app?
ar: هل انت متأكد من إغلاق التطبيق؟

source: Notifications
ar: إشعارات

# notificationsPermissionTitle
source: Allow Notifications
ar: السماح بالإشعارات

# notificationsPermissionMessage
source: We'd like to send you important updates and reminders. To receive notifications, please enable notification permissions for this app. You can do this in your device settings. Thank you!
ar: نود أن نرسل لك تحديثات وتذكيرات مهمة. لتلقي الإخطارات ، يرجى تمكين أذونات الإخطار لهذا التطبيق. يمكنك القيام بذلك في إعدادات جهازك. شكرًا لك!

# orderWithOtherNumber
source: Order #{orderNumber}
ar: الطلب {orderNumber}#

# cancelOrderWithOrderNumber
source: Order #{orderNumber}
ar: الطلب {orderNumber}#

# areYouSureWantToCancelOrder
source: Are you sure want to cancel the order?
ar: هل أنت متأكد من أنك تريد إلغاء الطلب؟

source: Order items
ar: عناصر الطلب

# lastUpdateInWithDate
source: Last update in {formattedDate}
ar: اخر تحديث في {formattedDate}

source: Admin notes
ar: ملاحظات الأدمن

source: Notes
ar: الملاحظات

source: Quantity
ar: الكمية

source: Price
ar: السعر

source: Name
ar: الأسم

# yourOrderWillBeDeliveredOnWithDeliveryDate
source: Your order will be delivered on {deliveryDate}
ar: سيتم توصيل طلبك في {deliveryDate}

# orderTotalWithPrice
source: Order total: {orderTotalPrice}
ar: المجموع الكلي: {orderTotalPrice}

# orderTotalBeforeDiscountsWithPrice
source: Order total before discounts: {orderTotalPrice}
ar: المجموع الكلي قبل الخصومات: {orderTotalPrice}

# bestSellingProducts
source: Best selling
ar: أفضل المنتجات مبيعًا

source: Newest products
ar: المنتجات الأحدث

source: Show more
ar: إظهار المزيد

source: Message
ar: الرسالة

source: Enter your message here
ar: ادخل رسالتك هنا

source: Close
ar: إغلاق

# areYouSureYouWantToRemoveCartItem
source: Are you sure you want remove the cart item?
ar: هل أنت متأكد أنك تريد إزالة عنصر سلة التسوق؟

# removeCartItem
source: Removing cart item
ar: إزالة عنصر سلة التسوق

# pleaseCheckYourInternetConnectionMsg
source: Please check your internet connection and try again.
ar: الرجاء التحقق من إتصالك بالأنترنيت والمحاولة مجددا.

# serverLimitErrorMsg
source: Sorry but the server have limit when connect to it
ar: عذرا لكن الخادم لدينا يستقبل لايستقبل عدد غير محدود من الإتصالات المتكررة

# serverLimitErrorTitle
source: Too many requests
ar: طلبات كثيرة جدا

source: Payment method
ar: طريقة الدفع

# payOrderMsg
source: Pay
ar: إدفع

# orderHasPaidMsg
source: Thank you for your payment! Your order status has been changed to process.
ar: شكرا لتسديدك! تم تغيير حالة طلبك للمعالجة.

# appName
source: Alrayada
ar: الريادة

source: Product images
ar: صور المنتج

source: Product
ar: المنتج

source: Category images
ar: صور الفئة

source: Category
ar: الفئة

source: About app
ar: حول التطبيق

source: Data
ar: البيانات

source: Auth screen
ar: واجهة تسجيل الدخول

source: Auth screen form inputs
ar: حقول واجهة تسجيل الدخول

source: Google icon
ar: ايقونة كوكل

source: Facebook icon
ar: ايقونة فيسبوك

source: Login with Google
ar: تسجيل الدخول مع كوكل

source: Login with facebook
ar: تسجيل الدخول مع فيسبوك

source: Login with Apple
ar: تسجيل الدخول مع ابل

source: Item
ar: عنصر

source: Welcome screen
ar: شاشة الترحيب

# transactionOfOrderNotPaidMsg
source: The transaction for this order hasn't been paid.
ar: لم يتم دفع المعاملة الخاصة بهذا الطلب.

# congratulationsYouHaveSavedWithPrice
source: Congratulations! You have saved {savedMoney} dollar
ar: تهانينا! لقد قمت بحفظ {savedMoney} دولار

source: Zain Cash
ar: زين كاش

source: Credit Card
ar: بطاقة إئتمان

source: Cash
ar: نقدي

source: Unknown
ar: غير معروف

source: Page Not Found
ar: الصفحة غير موجودة

# thisPageCantBeFoundMsg
source: This page can't be found, please get in touch with us if you believe this is a mistake.
ar: لا يمكن العثور على هذه الصفحة ، يرجى الاتصال بنا إذا كنت تعتقد أن هذا خطأ.

source: Baghdad
ar: بغداد

source: Basra
ar: البصرة

source: Maysan
ar: ميسان

source: DhiQar
ar: ذي قار

source: Diyala
ar: ديالى

source: Karbala
ar: كربلاء

source: Kirkuk
ar: كركوك

source: Najaf
ar: النجف

source: Nineveh
ar: نينوى

source: Wasit
ar: واسط

source: Anbar
ar: الأنبار

source: SalahAlDin
ar: صلاح الدين

source: Babil
ar: بابل

source: Babylon
ar: بابل

source: AlMuthanna
ar: المثنى

source: Al-Qadisiyyah
ar: القادسية

source: ThiQar
ar: ذي قار

source: Show Order Item Notes
ar: عرض ملاحظات عناصر الطلب

# showOrderItemNotesSettingsDesc
source: When you view the Desc of the order item, should the app show you the notes of each item in the table?
ar: عند عرض تفاصيل عنصر الطلب ، هل يجب أن يعرض لك التطبيق ملاحظات كل عنصر في الجدول؟

source: Empty
ar: فارغ

source: Sorry, this feature is not available at the moment
ar: آسف، هذه الميزة غير متوفرة في الوقت الراهن

source: Auto detect
ar: اكتشاف تلقائي

source: Version
ar: الإصدار

source: Please enter the lab name
ar: الرجاء إدخال اسم المختبر

source: Please enter the lab owner name
ar: الرجاء إدخال اسم مالك المختبر

source: Choose the lab city
ar: اختر مدينة المختبر

source: App Language
ar: لغة التطبيق

# appLanguageDesc
source: Choose your preferred language
ar: اختر لغتك المفضلة

source: I agree to
ar: انا اوافق على

source: Please agree to privacy policy first
ar: الرجاء الموافقة على سياسة الخصوصية اولا

source: Verify your email
ar: تحقق من بريدك الإلكتروني

# verifyYourEmailDesc
source: Exciting news! Your account is almost ready for a fantastic shopping journey. Verify your email now for exclusive access and a seamless experience!
ar: أخبار مثيرة! حسابك جاهز تقريبًا لرحلة تسوق رائعة. قم بالتحقق من بريدك الإلكتروني الآن للوصول الحصري وتجربة سلسة!

# continueText
source: Continue
ar: المتابعة

source: Resend email
ar: إعادة إرسال البريد الإلكتروني

source: Your account has been successfully created
ar: تم إنشاء حسابك بنجاح

source: Report
ar: أبلغ

# authUserDisabledErrorMessage
source: Your account is disabled. Please contact support for more information.
ar: حسابك معطل، الرجاء التواصل معنا للمزيد من المعلومات

# authProviderIsDisabledMessage
source: This auth provider is disabled, please contact us for more info.
ar: مزود تسجيل الدخول معطل، الرجاء التواصل معنا للمزيد من المعلومات

source: Email is still not verified.
ar: لم يتم التحقق من البريد الإلكتروني بعد.

# authEmailVerificationLinkSent
source: Verification Email Sent! Check your inbox.
ar: تم إرسال رابط التحقق عبر البريد الإلكتروني! تحقق من صندوق الوارد الخاص بك.

# useClassicMaterial
source: Classic Material Design
ar: استخدام التصميم الكلاسيكي

# useClassicMaterialDesc
source: Use the classic Material Design theme
ar: هل ترغب في استخدام تصميم Material 2 القديم؟

source: Layout Mode
ar: وضع التخطيط

# layoutModeDesc
source: Choose your preferred layout (default based on your device)
ar: اختر التخطيط المفضل لديك (سيتم اختيار القيمة الافتراضية بناءً على جهازك)

source: Large
ar: كبير

source: Small
ar: صغير

source: Sign in with Apple is not supported on your device.
ar: تسجيل الدخول مع التفاح غير مدعوم علي جهازك

source: Too many requests, please try again later
ar: هنالك طلبات كثيرة، الرجاء المحاولة لاحقا

source: Your email is not verified.
ar: بريدك الإلكتروني غير مؤكد.

# enterSignUpDataDesc
source: Unlock the door to a world of possibilities! Kindly furnish us with your details to embark on your journey with us.
ar: افتح الباب أمام عالم من الاحتمالات! يرجى تزويدنا بالتفاصيل الخاصة بك لبدء رحلتك معنا.
